<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;

class CreateBibleCategoriesTable extends Migration {

	public function up()
	{
//		Schema::create('bible_categories', function(Blueprint $table) {
//			$table->increments('id');
//            $table->tinyInteger('status')->unsigned()->default(1);
//            $table->integer('sort');
//            $table->string('title', 50);
//			$table->string('sub_title', 500);
//			$table->string('image', 500);
//			$table->string('anchor', 50);
//            $table->timestamps();
//            $table->softDeletes();
//		});
        \DB::connection('mysql')->statement("CREATE TABLE `bible_categories` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `status` tinyint(3) unsigned NOT NULL DEFAULT '1',
  `sort` int(11) NOT NULL,
  `title` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `sub_title` varchar(500) COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(500) COLLATE utf8mb4_unicode_ci NOT NULL,
  `anchor` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;");

\DB::connection('mysql')->statement("INSERT INTO `bible_categories` (`id`, `status`, `sort`, `title`, `sub_title`, `image`, `anchor`, `created_at`, `updated_at`, `deleted_at`)
VALUES
	(1,1,1,'創世記','創世記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(2,1,1,'出埃及記','出埃及記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(3,1,1,'利未記','利未記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(4,1,1,'民數記','民數記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(5,1,1,'申命記','申命記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(6,1,1,'約書亞記','約書亞記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(7,1,1,'士師記','士師記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(8,1,1,'路得記','路得記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(9,1,1,'撒母耳記上','撒母耳記上','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(10,1,1,'撒母耳記下','撒母耳記下','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(11,1,1,'列王紀上','列王紀上','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(12,1,1,'列王紀下','列王紀下','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(13,1,1,'歷代志上','歷代志上','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(14,1,1,'歷代志下','歷代志下','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(15,1,1,'以斯拉記','以斯拉記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(16,1,1,'尼希米記','尼希米記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(17,1,1,'以斯帖記','以斯帖記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(18,1,1,'約伯記','約伯記','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(19,1,1,'詩篇','詩篇','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(20,1,1,'箴言','箴言','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(21,1,1,'傳道書','傳道書','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(22,1,1,'雅歌','雅歌','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(23,1,1,'以賽亞書','以賽亞書','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(24,1,1,'耶利米書','耶利米書','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(25,1,1,'耶利米哀歌','耶利米哀歌','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(26,1,1,'以西結書','以西結書','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(27,1,1,'但以理書','但以理書','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(28,1,1,'何西阿書','何西阿書','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(29,1,1,'約珥書','約珥書','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(30,1,1,'阿摩司書','阿摩司書','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(31,1,1,'俄巴底亞書','俄巴底亞書','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(32,1,1,'約拿書','約拿書','','閻大衛','2019-11-20 12:00:39','2019-11-20 12:00:39',NULL),
	(33,1,1,'彌迦書','彌迦書','','閻大衛','2019-11-20 12:00:40','2019-11-20 12:00:40',NULL),
	(34,1,1,'那鴻書','那鴻書','','閻大衛','2019-11-20 12:00:40','2019-11-20 12:00:40',NULL),
	(35,1,1,'哈巴谷書','哈巴谷書','','閻大衛','2019-11-20 12:00:40','2019-11-20 12:00:40',NULL),
	(36,1,1,'西番雅書','西番雅書','','閻大衛','2019-11-20 12:00:40','2019-11-20 12:00:40',NULL),
	(37,1,1,'哈該書','哈該書','','閻大衛','2019-11-20 12:00:40','2019-11-20 12:00:40',NULL),
	(38,1,1,'撒迦利亞書','撒迦利亞書','','閻大衛','2019-11-20 12:00:40','2019-11-20 12:00:40',NULL),
	(39,1,1,'瑪拉基書','瑪拉基書','','閻大衛','2019-11-20 12:00:40','2019-11-20 12:00:40',NULL);");
	}

	public function down()
	{
		Schema::drop('bible_categories');
	}
}
